[
  {
    "name": "Erawan",
    "location": "Lot L1-17 & L1-18, First Floor, DC Mall, Damansara City, 6 Jalan Damanlela, 50490 Kuala Lumpur",
    "google_maps_link": "https://www.google.com/maps?q=DC+Mall,+Damansara+City,+Lot+L1-17-18,+First+Floor+DC+mall&ll=3.14625,101.661&z=17",
    "description": "Erawan is a highly-regarded Thai restaurant in Kuala Lumpur, known for its fine dining experience and authentic, flavorful cuisine. It has received accolades and is considered one of the best Thai restaurants in the city. The restaurant is helmed by the award-winning Chef Korn Yodsuk. The menu features a range of traditional and fusion Thai dishes, with a focus on high-quality ingredients and detailed preparation. You can even choose the spiciness level of your dishes. Erawan is located at DC Mall in Damansara Heights, and the restaurant has a modern, sleek, and elegant feel, making it suitable for intimate dinners and special occasions.",
    "image_links": [
      "https://funntaste.com/wp-content/uploads/2019/01/Erawan-Thai-Restaurant-DC-Mall-KL-1.jpg",
      "https://media-cdn.tripadvisor.com/media/photo-o/1/1a/b7/a7/erawan.jpg"
    ]
  },
  {
    "name": "Gai by Darren Chin",
    "location": "No. 26A, Lorong Datuk Sulaiman 1, Taman Tun Dr Ismail, 60000 Kuala Lumpur",
    "google_maps_link": "https://www.google.com/maps/place/Gai+by+Darren+Chin/@3.13835,101.63095,17z/data=!3m1!4b1!4m6!3m5!1s0x31cc4921aadd513d:0x40112a121311b01!8m2!3d3.1383446!4d101.6335249!16s%2Fg%2F11s6z1z3zv?entry=ttu",
    "description": "Gai by Darren Chin is a well-regarded Thai restaurant in Kuala Lumpur, known for its interpretation of Northern Thai cuisine. It is a family affair, with Chef Darren Chin's Thai wife, Nana, and her parents being the heart and soul of the restaurant. The restaurant aims to present authentic Northern Thai recipes in a contemporary and elevated manner. Gai, which means “chicken” in Thai, offers a menu that embodies the spirit of family-style dining. The dishes are meant to be shared and represent a reinterpretation of common Thai recipes with careful thought and flair, balancing salty, sweet, spicy, and sour flavors.",
    "image_links": [
      "https://media.timeout.com/images/105894933/750/422/image.jpg",
      "https://media-cdn.tripadvisor.com/media/photo-s/1b/3a/8b/7a/photo0-jpg.jpg"
    ]
  },
  {
    "name": "Malai Thai Cuisine",
    "location": "Ground Floor, Menara Ample West, 6, Jalan P. Ramlee, Kuala Lumpur, Malaysia, 50250",
    "google_maps_link": "https://www.google.com/maps/place/Malai+Thai+Cuisine/@3.154693,101.706348,17z/data=!3m1!4b1!4m6!3m5!1s0x31cc49d5e1531c77:0x4337152b66a43e45!8m2!3d3.154693!4d101.706348!16s%2Fg%2F11k4y7_q5g?entry=ttu",
    "description": "Malai Thai Cuisine is a well-regarded Thai restaurant in the heart of Kuala Lumpur, recognized by the Michelin Guide and holding a “Thai Select” certification for its authentic cuisine. The restaurant has relocated and is now at Menara Ample West, 6, Jalan P. Ramlee, a short distance from KLCC. It offers a beautifully decorated and elegant setting with a choice of tables and booths to accommodate both intimate dinners and larger groups. The decor features rich woodwork and warm lighting, creating a cozy and inviting atmosphere that transports diners to Thailand. Malai Thai is known for its authentic Thai flavors, with a menu prepared by a team of mostly Thai chefs who bring their expertise from Thailand.",
    "image_links": [
      "https://theyumlist.net/wp-content/uploads/2022/09/Malai-Thai-Cuisine-KL-City-Centre-1-1.jpg",
      "https://media-cdn.tripadvisor.com/media/photo-s/1a/8a/8a/8a/malai-thai-cuisine.jpg"
    ]
  },
  {
    "name": "KomPassion",
    "location": "5, Jalan SS 20/11, Damansara Kim, 47400 Petaling Jaya, Selangor",
    "google_maps_link": "https://www.google.com/maps/place/Kompassion/@3.13488,101.62494,17z/data=!3m1!4b1!4m5!3m4!1s0x31cc4921aadd513d:0x40112a121311b01!8m2!3d3.13488!4d101.62713!16s%2Fg%2F11c1z1z3zv?entry=ttu",
    "description": "KomPassion is a well-regarded Thai restaurant in Kuala Lumpur, known for its modern and inventive approach to Thai cuisine. It has expanded to two locations, each offering a unique dining experience. The original KomPassion in Damansara Kim is celebrated for its extensive menu that includes pork dishes, making it a popular destination for non-halal Thai food enthusiasts. The creative force behind KomPassion is Chef Nikom Uatthong, who hails from Chiang Rai. The menu is a testament to his innovative approach, blending traditional Thai flavors with modern culinary techniques and ingredients from other Asian cuisines. KomPassion generally receives positive reviews for its flavorful and creative dishes.",
    "image_links": [
      "https://theyumlist.net/wp-content/uploads/2016/12/Kompassion-Thai-Fusion-Food-Damansara-Kim-1.jpg",
      "https://media-cdn.tripadvisor.com/media/photo-o/0e/7c/3b/5a/pork-belly-with-soft.jpg"
    ]
  },
  {
    "name": "La Moon Thai Restaurant",
    "location": "2, Jalan Wan Kadir, Taman Tun Dr Ismail, 60000 Kuala Lumpur, Malaysia",
    "google_maps_link": "https://www.google.com/maps/place/Restoran+La+Moon/@3.139434,101.6298768,17z/data=!3m1!4b1!4m5!3m4!1s0x31cc493c00000001:0x8a78e463e8416465!8m2!3d3.139434!4d101.6320655",
    "description": "La Moon is a well-regarded Thai restaurant in Kuala Lumpur, located in the Taman Tun Dr Ismail (TTDI) area. It is run by Chef Korn (Trakool Yodsuk), who was previously behind the acclaimed Erawan restaurant. La Moon aims to serve authentic, home-style Thai cuisine that is both affordable and reminiscent of traditional family cooking. La Moon offers a variety of classic and innovative Thai dishes. The restaurant has a charming and welcoming atmosphere with high ceilings and plenty of natural light. Service is described as quick, courteous, and hospitable, with Chef Korn often personally interacting with guests.",
    "image_links": [
      "https://bangsarbabe.com/wp-content/uploads/2022/05/La-Moon-TTDI-1.jpg",
      "https://media-cdn.tripadvisor.com/media/photo-o/1/1a/b7/a7/la-moon.jpg"
    ]
  },
  {
    "name": "Baan 26",
    "location": "No. 26, Jalan Changkat Bukit Bintang, 50200 Kuala Lumpur, Malaysia",
    "google_maps_link": "https://www.google.com/maps/search/?api=1&query=Baan+26+Changkat+Bukit+Bintang",
    "description": "Baan 26 is a well-regarded Thai restaurant and bar located in the lively Changkat Bukit Bintang area of Kuala Lumpur, Malaysia. The name “Baan 26” translates to “House No. 26,” reflecting its address and the welcoming, homely atmosphere it aims to create. Baan 26 specializes in authentic Thai cuisine, offering a wide range of familiar and popular dishes. Situated on Changkat Bukit Bintang, a street known for its vibrant nightlife, Baan 26 has a cozy and energetic atmosphere. The decor features striking red tones and traditional Thai elements, creating a setting that is suitable for both casual dining and more intimate occasions.",
    "image_links": [
      "https://baan26.com/wp-content/uploads/2020/07/Baan-26-Thai-Restaurant-Bar-Changkat-Bukit-Bintang-KL-City-Centre-1.jpg",
      "https://media-cdn.tripadvisor.com/media/photo-o/08/7d/f3/4a/baan-26.jpg"
    ]
  },
  {
    "name": "Boran Classic Thai Street Food",
    "location": "25G, Jalan 21/11a, Sea Park, 46300 Petaling Jaya, Selangor, Malaysia",
    "google_maps_link": "https://www.waze.com/live-map/directions/my/selangor/petaling-jaya/boran-(seapark)---classic-thai-street-food",
    "description": "Boran Classic Thai Street Food is a restaurant chain in Kuala Lumpur, Malaysia, that serves authentic Thai street food. The name “Boran” means “ancient” or “traditional” in Thai, reflecting the restaurant’s focus on time-honored recipes. The founders hail from Chonburi, a province in Thailand known for its vibrant street food scene. Boran offers a variety of classic Thai street food dishes, with a focus on pork-based meals. The restaurants are designed to have a casual, no-frills setting that reflects the atmosphere of a Thai street food market. The interiors are often decorated with vintage posters and photos of Bangkok.",
    "image_links": [
      "https://erisgoesto.com/wp-content/uploads/2022/05/Boran-Classic-Thai-Street-Food-1.jpg",
      "https://media-cdn.tripadvisor.com/media/photo-o/1/1a/b7/a7/boran.jpg"
    ]
  },
  {
    "name": "SOI 55 Thai Kitchen",
    "location": "16, Jalan Solaris 5, Solaris Mont Kiara, 50480 Kuala Lumpur",
    "google_maps_link": "https://maps.app.goo.gl/zYEkfckgCbnQx1Bb9",
    "description": "Soi 55 Thai Kitchen is a popular restaurant chain in Kuala Lumpur, Malaysia, known for serving authentic Thai cuisine. The name “Soi 55” is a combination of the Thai word “soi,” meaning street, and the number 55, which is pronounced “Haa Haa” in Thai and symbolizes laughter and happiness. Soi 55 has multiple outlets across Kuala Lumpur and the Klang Valley. Soi 55 offers a diverse menu of classic Thai dishes. Reviews for Soi 55 are generally positive, with many customers praising the authentic taste of the food and the good service. Some reviewers have noted that the food can be spicy, so it’s a good idea to let the staff know your preference.",
    "image_links": [
      "https://soi55.my/wp-content/uploads/2020/07/Soi-55-Thai-Kitchen-Sri-Damansara-1.jpg",
      "https://media-cdn.tripadvisor.com/media/photo-o/1/1a/b7/a7/soi-55.jpg"
    ]
  },
  {
    "name": "Heng Dee by Nhom Thai",
    "location": "16, Jalan SS 21/35, Damansara Utama, 47400 Petaling Jaya, Selangor",
    "google_maps_link": "https://maps.app.goo.gl/vD3gDnf7u3FGVZH97",
    "description": "Heng Dee by Nhom Thai is a popular Thai restaurant located in Damansara Uptown, Petaling Jaya, which is part of the greater Kuala Lumpur area. It was opened in June 2022 by a Malaysian and Thai husband-and-wife team and has since become a popular spot for authentic Thai cuisine. The restaurant is particularly well-known for its duck dishes, which are prepared using a family recipe from Nakhon Pathom province in Thailand. The signature dish is the Nhom Thai duck noodles, which features a rich, dark, and flavorful broth. Heng Dee also offers a variety of pork dishes, including the Original Pork Soup, which is described as a comforting and soulful broth with tender pork slices, meatballs, and crispy lard.",
    "image_links": [
      "https://eatdrinkkl.com/wp-content/uploads/2022/10/Heng-Dee-6.jpg",
      "https://eatdrinkkl.com/wp-content/uploads/2022/07/Heng-Dee-by-Nhom-Thai-1.jpg"
    ]
  },
  {
    "name": "Imperial Chakri Palace",
    "location": "Lot 417B, Level 4, Suria KLCC, Kuala Lumpur City Centre, 50088 Kuala Lumpur, Malaysia",
    "google_maps_link": "https://www.google.com/maps/search/?api=1&query=Imperial+Chakri+Palace+Suria+KLCC",
    "description": "Imperial Chakri Palace is a renowned Thai restaurant in Kuala Lumpur, Malaysia, known for its authentic Royal Thai cuisine. It has been serving customers for over two decades and has garnered several awards for its culinary excellence. The restaurant prides itself on serving authentic Thai food, with a team of experienced Thai chefs, including one with experience in the Royal Palace. They emphasize the use of fresh, organic, ingredients, healthy cooking methods, and no added MSG or preservatives. The restaurant aims to provide a regal Thai atmosphere, allowing guests to experience Thai cuisine as if they were royalty. Reviews describe the ambiance as cozy and elegant.",
    "image_links": [
      "https://media-cdn.tripadvisor.com/media/photo-s/0f/3f/63/57/chakri-palace-klcc.jpg",
      "https://media-cdn.tripadvisor.com/media/photo-o/0a/0a/6a/9d/imperial-chakri-palace.jpg"
    ]
  }
]